# TIME SERIES ANALYSIS 

Time series contains a sequence of data points which are indexed in an order.This order is basically the time in which they happened or recorded.
Points are recorded at discrete time with equal space intervals.

Time Series forecasting is the way to predict the behaviour using past data points. Forecasting is very much useful to know the direction of data.

Time series forecasting is different from Supervised Learning. 
In supervised learning we assume that all observations are independent from each other.Data recorded can be used in any order and they do not have any specific order to follow.
This is not the case with Time Series.In time series data points sequence makes a lot of sense and we cannot ignore it.
With the sequence we can find short term trends in data points.

In [2]:
!pip install statsmodels

Collecting statsmodels
  Downloading https://files.pythonhosted.org/packages/9f/fd/a42d857429f5a5eeda0fcb9eca0d078fb7a7370a49b7cc79550906930166/statsmodels-0.9.0-cp35-cp35m-win_amd64.whl (7.0MB)
Installing collected packages: statsmodels
Successfully installed statsmodels-0.9.0

You are using pip version 9.0.1, however version 10.0.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [4]:
!pip install patsy

Collecting patsy
  Downloading https://files.pythonhosted.org/packages/5d/eb/92c4b45ca47a2dd1339c958636e083b50ffadb5162a599a1cbbe92f89832/patsy-0.5.0-py2.py3-none-any.whl (232kB)
Requirement already satisfied: six in c:\users\intel\anaconda3\envs\tfdeeplearning\lib\site-packages (from patsy)
Requirement already satisfied: numpy>=1.4 in c:\users\intel\anaconda3\envs\tfdeeplearning\lib\site-packages (from patsy)
Installing collected packages: patsy
Successfully installed patsy-0.5.0

You are using pip version 9.0.1, however version 10.0.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

# DATE  AND TIME HANDLING IN PANDAS

In [1]:
#Import library
import pandas  as pd
import numpy  as np
import math 
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib.pylab
from statsmodels.tsa import stattools

# Generaing data in time range

In [7]:
#Consider pandas date_range function to generate data for 20 days
#this function generates data for 20 days starting from 2018 July 16 and frequency is weekly.
#parameter 1 --> starting date
#period ---> count we want to generate
#freq ----> Frequency in the sequence
pd.date_range('2018 Jul 16', periods = 20, freq = 'W')

DatetimeIndex(['2018-07-22', '2018-07-29', '2018-08-05', '2018-08-12',
               '2018-08-19', '2018-08-26', '2018-09-02', '2018-09-09',
               '2018-09-16', '2018-09-23', '2018-09-30', '2018-10-07',
               '2018-10-14', '2018-10-21', '2018-10-28', '2018-11-04',
               '2018-11-11', '2018-11-18', '2018-11-25', '2018-12-02'],
              dtype='datetime64[ns]', freq='W-SUN')

In [8]:
#frequency - Daily
pd.date_range('2018 Jul 16', periods = 20, freq = 'D')

DatetimeIndex(['2018-07-16', '2018-07-17', '2018-07-18', '2018-07-19',
               '2018-07-20', '2018-07-21', '2018-07-22', '2018-07-23',
               '2018-07-24', '2018-07-25', '2018-07-26', '2018-07-27',
               '2018-07-28', '2018-07-29', '2018-07-30', '2018-07-31',
               '2018-08-01', '2018-08-02', '2018-08-03', '2018-08-04'],
              dtype='datetime64[ns]', freq='D')

In [22]:
#Generate data for business days 
pd.date_range('2018 Jul 1', periods = 20, freq = 'B')

DatetimeIndex(['2018-07-02', '2018-07-03', '2018-07-04', '2018-07-05',
               '2018-07-06', '2018-07-09', '2018-07-10', '2018-07-11',
               '2018-07-12', '2018-07-13', '2018-07-16', '2018-07-17',
               '2018-07-18', '2018-07-19', '2018-07-20', '2018-07-23',
               '2018-07-24', '2018-07-25', '2018-07-26', '2018-07-27'],
              dtype='datetime64[ns]', freq='B')

In [6]:
from datetime import datetime
#Return a fixed frequency datetime index, with business day as the default
start = datetime(2018, 1, 1)
end = datetime(2019, 1, 1)
pd.bdate_range(start,end, freq='B')

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-08', '2018-01-09', '2018-01-10',
               '2018-01-11', '2018-01-12',
               ...
               '2018-12-19', '2018-12-20', '2018-12-21', '2018-12-24',
               '2018-12-25', '2018-12-26', '2018-12-27', '2018-12-28',
               '2018-12-31', '2019-01-01'],
              dtype='datetime64[ns]', length=262, freq='B')

In [24]:
#Generate data for every hour
pd.date_range('2018 Jul 1', periods = 24, freq = 'H')

DatetimeIndex(['2018-07-01 00:00:00', '2018-07-01 01:00:00',
               '2018-07-01 02:00:00', '2018-07-01 03:00:00',
               '2018-07-01 04:00:00', '2018-07-01 05:00:00',
               '2018-07-01 06:00:00', '2018-07-01 07:00:00',
               '2018-07-01 08:00:00', '2018-07-01 09:00:00',
               '2018-07-01 10:00:00', '2018-07-01 11:00:00',
               '2018-07-01 12:00:00', '2018-07-01 13:00:00',
               '2018-07-01 14:00:00', '2018-07-01 15:00:00',
               '2018-07-01 16:00:00', '2018-07-01 17:00:00',
               '2018-07-01 18:00:00', '2018-07-01 19:00:00',
               '2018-07-01 20:00:00', '2018-07-01 21:00:00',
               '2018-07-01 22:00:00', '2018-07-01 23:00:00'],
              dtype='datetime64[ns]', freq='H')

In [25]:
pd.period_range('2018-06-01','2018-07-01', freq = 'D')

PeriodIndex(['2018-06-01', '2018-06-02', '2018-06-03', '2018-06-04',
             '2018-06-05', '2018-06-06', '2018-06-07', '2018-06-08',
             '2018-06-09', '2018-06-10', '2018-06-11', '2018-06-12',
             '2018-06-13', '2018-06-14', '2018-06-15', '2018-06-16',
             '2018-06-17', '2018-06-18', '2018-06-19', '2018-06-20',
             '2018-06-21', '2018-06-22', '2018-06-23', '2018-06-24',
             '2018-06-25', '2018-06-26', '2018-06-27', '2018-06-28',
             '2018-06-29', '2018-06-30', '2018-07-01'],
            dtype='period[D]', freq='D')

# Working with timestamps

Timestamps are used to denote one moment of time.It represents time in discrete levels.This is achieved through pandas Timestamp function

In [26]:
period = pd.Period('Jul 2018')
print('Start time', period.start_time)
print('End time',period.end_time)

Start time 2018-07-01 00:00:00
End time 2018-07-31 23:59:59.999999999

In [9]:
pd.Timestamp('2018 Jul 1')

Timestamp('2018-07-01 00:00:00')

In [19]:
#get current timestamp from datetime.now() function
time = datetime.now()
timestamp = pd.Timestamp(time)
timestamp

Timestamp('2018-07-01 19:50:54.713834')

In [20]:
print('Day of the timestamp {}'.format(timestamp.day))
print('Week of the timestamp {}'.format(timestamp.week))
print('minute of the timestamp {}'.format(timestamp.minute))
print('day of the week of the timestamp {}'.format(timestamp.dayofweek))
print('Year is leap year or not {}'.format(timestamp.is_leap_year))

Day of the timestamp 1
Week of the timestamp 26
minute of the timestamp 50
day of the week of the timestamp 6
Year is leap year or not False

# Timestamp Delta Functions in Pandas

In [27]:
timestamp + pd.Timedelta('1 day')

Timestamp('2018-07-02 19:50:54.713834')

In [28]:
# we can add hour / minutes / seconds same way
timestamp + pd.Timedelta('1 Hour 10 minutes')

Timestamp('2018-07-01 21:00:54.713834')

In [29]:
timestamp + pd.Timedelta(' 1 day 1 Hour 10 minutes')

Timestamp('2018-07-02 21:00:54.713834')

In [30]:
timestamp -  pd.Timedelta('1 Hour 10 minutes')

Timestamp('2018-07-01 18:40:54.713834')

In [32]:
timestamp - pd.Timedelta('1 day')

Timestamp('2018-06-30 19:50:54.713834')

In [33]:
#we can also check the validity of a timestamp within a period or not
period = pd.Period('Jul 2018')
print('timestamp :',timestamp)
print('Start time', period.start_time)
print('End time',period.end_time)
print(period.start_time<timestamp and period.end_time>timestamp)

timestamp : 2018-07-01 19:50:54.713834
Start time 2018-07-01 00:00:00
End time 2018-07-31 23:59:59.999999999
True

In [36]:
#create buckets of periods within a range using period_range function
#pd.period_range(start=None, end=None, periods=None, freq='D', name=None)
#frequency specified as Day D
pd.period_range('2018-06-01','2018-06-30',freq='D')

PeriodIndex(['2018-06-01', '2018-06-02', '2018-06-03', '2018-06-04',
             '2018-06-05', '2018-06-06', '2018-06-07', '2018-06-08',
             '2018-06-09', '2018-06-10', '2018-06-11', '2018-06-12',
             '2018-06-13', '2018-06-14', '2018-06-15', '2018-06-16',
             '2018-06-17', '2018-06-18', '2018-06-19', '2018-06-20',
             '2018-06-21', '2018-06-22', '2018-06-23', '2018-06-24',
             '2018-06-25', '2018-06-26', '2018-06-27', '2018-06-28',
             '2018-06-29', '2018-06-30'],
            dtype='period[D]', freq='D')

# Using TimeZone functionality with Timestamps

In [39]:
#Localize to timezone Asia/Kolkata using timestamp localize function tz_localize
time = datetime.now()
second_stamp = pd.Timestamp(time)
second_stamp.tz_localize('Asia/Kolkata')

Timestamp('2018-07-01 20:45:31.461357+0530', tz='Asia/Kolkata')

In [41]:
#Localize the same timestamp again and assign it in different variable
third_stamp = second_stamp.tz_localize('Africa/Addis_Ababa')
third_stamp

Timestamp('2018-07-01 20:45:31.461357+0300', tz='Africa/Addis_Ababa')

In [43]:
#tz_localize() function will change the timestone but will not convert it.
#tz_convert() will convert the timestamp accordingly to a new timezone.
#This comes handy when we have data from different timezones and we want to make it unique and arrange in a sequence.

#we can convert one timezone to another timezone. Timestamp time and date will change accordingly
third_stamp.tz_convert('America/Manaus')

Timestamp('2018-07-01 13:45:31.461357-0400', tz='America/Manaus')

In [45]:
#Get list of all timezones in pandas
from pytz import all_timezones
print(len(all_timezones))
print(all_timezones[1:20])

593
['Africa/Accra', 'Africa/Addis_Ababa', 'Africa/Algiers', 'Africa/Asmara', 'Africa/Asmera', 'Africa/Bamako', 'Africa/Bangui', 'Africa/Banjul', 'Africa/Bissau', 'Africa/Blantyre', 'Africa/Brazzaville', 'Africa/Bujumbura', 'Africa/Cairo', 'Africa/Casablanca', 'Africa/Ceuta', 'Africa/Conakry', 'Africa/Dakar', 'Africa/Dar_es_Salaam', 'Africa/Djibouti']

# Reading data from file

Let's understand reading a file in python that contains dates related information. This data has an entry for each month and value associated with it.

In [48]:
with open('C:/Users/INTEL/Desktop/Books/Tensorflow/Machine Learning Codes/Exercise Files/data/monthly_price.csv') as f:
    for x in range(10):
        print(next(f))

Date,Price

1/31/2000,219.94244929860963

2/29/2000,275.1176471652472

3/31/2000,263.19820260943925

4/30/2000,253.4287672679725

5/31/2000,215.7426023601063

6/30/2000,261.0963353861061

7/31/2000,213.31405900429868

8/31/2000,263.70375803608897

9/30/2000,233.68668730084215

In [49]:
#use pandas read_csv function to read the file
data = pd.read_csv('C:/Users/INTEL/Desktop/Books/Tensorflow/Machine Learning Codes/Exercise Files/data/monthly_price.csv')

In [50]:
data.head()

        Date       Price
0  1/31/2000  219.942449
1  2/29/2000  275.117647
2  3/31/2000  263.198203
3  4/30/2000  253.428767
4  5/31/2000  215.742602

In [53]:
data = pd.read_csv('C:/Users/INTEL/Desktop/Books/Tensorflow/Machine Learning Codes/Exercise Files/data/monthly_price.csv',parse_dates=['Date'])
data.head()

        Date       Price
0 2000-01-31  219.942449
1 2000-02-29  275.117647
2 2000-03-31  263.198203
3 2000-04-30  253.428767
4 2000-05-31  215.742602

In [55]:
data.tail()

         Date       Price
67 2005-08-31  305.240185
68 2005-09-30  315.102514
69 2005-10-31  323.380634
70 2005-11-30  334.474315
71 2005-12-31  379.632000

When we observe the data, it contains one entry for each month for 6 years. So first we need to get rid of day from date

In [56]:
#First take year and month from the date
data['Year'] = data.Date.dt.year 
data['Month'] = data.Date.dt.month

In [57]:
data.head()

        Date       Price  Year  Month
0 2000-01-31  219.942449  2000      1
1 2000-02-29  275.117647  2000      2
2 2000-03-31  263.198203  2000      3
3 2000-04-30  253.428767  2000      4
4 2000-05-31  215.742602  2000      5

In [59]:
#Change Date coloumn
data['Date'] = data['Date'].astype(str)
for index,row in data.iterrows():
    print(index,row)
    #data.set_value(index, col, value, takeable=False) --> Put single value at passed column and index
    data.set_value(index,'Date',str(row['Year']) + '-' + str(row['Month']))

0 Date     2000-01-31
Price       219.942
Year           2000
Month             1
Name: 0, dtype: object
1 Date     2000-02-29
Price       275.118
Year           2000
Month             2
Name: 1, dtype: object
2 Date     2000-03-31
Price       263.198
Year           2000
Month             3
Name: 2, dtype: object
3 Date     2000-04-30
Price       253.429
Year           2000
Month             4
Name: 3, dtype: object
4 Date     2000-05-31
Price       215.743
Year           2000
Month             5
Name: 4, dtype: object
5 Date     2000-06-30
Price       261.096
Year           2000
Month             6
Name: 5, dtype: object
6 Date     2000-07-31
Price       213.314
Year           2000
Month             7
Name: 6, dtype: object
7 Date     2000-08-31
Price       263.704
Year           2000
Month             8
Name: 7, dtype: object
8 Date     2000-09-30
Price       233.687
Year           2000
Month             9
Name: 8, dtype: object
9 Date     2000-10-31
Price       221.363
Year           2000
Month            10
Name: 9, dtype: object
10 Date     2000-11-30
Price       221.518
Year           2000
Month            11
Name: 10, dtype: object
11 Date     2000-12-31
Price       177.455
Year           2000
Month            12
Name: 11, dtype: object
12 Date     2001-01-31
Price         210.6
Year           2001
Month             1
Name: 12, dtype: object
13 Date     2001-02-28
Price       187.125
Year           2001
Month             2
Name: 13, dtype: object
14 Date     2001-03-31
Price       120.377
Year           2001
Month             3
Name: 14, dtype: object
15 Date     2001-04-30
Price       118.013
Year           2001
Month             4
Name: 15, dtype: object
16 Date     2001-05-31
Price       122.284
Year           2001
Month             5
Name: 16, dtype: object
17 Date     2001-06-30
Price       117.955
Year           2001
Month             6
Name: 17, dtype: object
18 Date     2001-07-31
Price       120.734
Year           2001
Month             7
Name: 18, dtype: object
19 Date     2001-08-31
Price       118.759
Year           2001
Month             8
Name: 19, dtype: object
20 Date     2001-09-30
Price       72.5324
Year           2001
Month             9
Name: 20, dtype: object
21 Date     2001-10-31
Price       90.9047
Year           2001
Month            10
Name: 21, dtype: object
22 Date     2001-11-30
Price       114.164
Year           2001
Month            11
Name: 22, dtype: object
23 Date     2001-12-31
Price       124.524
Year           2001
Month            12
Name: 23, dtype: object
24 Date     2002-01-31
Price       119.586
Year           2002
Month             1
Name: 24, dtype: object
25 Date     2002-02-28
Price       107.263
Year           2002
Month             2
Name: 25, dtype: object
26 Date     2002-03-31
Price        123.23
Year           2002
Month             3
Name: 26, dtype: object
27 Date     2002-04-30
Price       112.827
Year           2002
Month             4
Name: 27, dtype: object
28 Date     2002-05-31
Price       107.871
Year           2002
Month             5
Name: 28, dtype: object
29 Date     2002-06-30
Price       102.481
Year           2002
Month             6
Name: 29, dtype: object
30 Date     2002-07-31
Price       95.8382
Year           2002
Month             7
Name: 30, dtype: object
31 Date     2002-08-31
Price       114.338
Year           2002
Month             8
Name: 31, dtype: object
32 Date     2002-09-30
Price       106.899
Year           2002
Month             9
Name: 32, dtype: object
33 Date     2002-10-31
Price       114.262
Year           2002
Month            10
Name: 33, dtype: object
34 Date     2002-11-30
Price       141.478
Year           2002
Month            11
Name: 34, dtype: object
35 Date     2002-12-31
Price       149.954
Year           2002
Month            12
Name: 35, dtype: object
36 Date     2003-01-31
Price       133.394
Year           2003
Month             1
Name: 36, dtype: object
37 Date     2003-02-28
Price       135.085
Year           2003
Month             2
Name: 37, dtype: object
38 Date     2003-03-31
Price       121.277
Year           2003
Month             3
Name: 38, dtype: object
39 Date     2003-04-30
Price       82.4265
Year           2003
Month             4
Name: 39, dtype: object
40 Date     2003-05-31
Price         86.51
Year           2003
Month             5
Name: 40, dtype: object
41 Date     2003-06-30
Price       98.2163
Year           2003
Month             6
Name: 41, dtype: object
42 Date     2003-07-31
Price       117.968
Year           2003
Month             7
Name: 42, dtype: object
43 Date     2003-08-31
Price       127.001
Year           2003
Month             8
Name: 43, dtype: object
44 Date     2003-09-30
Price       138.511
Year           2003
Month             9
Name: 44, dtype: object
45 Date     2003-10-31
Price       147.333
Year           2003
Month            10
Name: 45, dtype: object
46 Date     2003-11-30
Price       150.415
Year           2003
Month            11
Name: 46, dtype: object
47 Date     2003-12-31
Price       172.633
Year           2003
Month            12
Name: 47, dtype: object
48 Date     2004-01-31
Price       167.877
Year           2004
Month             1
Name: 48, dtype: object
49 Date     2004-02-29
Price       151.634
Year           2004
Month             2
Name: 49, dtype: object
50 Date     2004-03-31
Price       157.079
Year           2004
Month             3
Name: 50, dtype: object
51 Date     2004-04-30
Price       161.116
Year           2004
Month             4
Name: 51, dtype: object
52 Date     2004-05-31
Price       161.614
Year           2004
Month             5
Name: 52, dtype: object
53 Date     2004-06-30
Price       169.627
Year           2004
Month             6
Name: 53, dtype: object
54 Date     2004-07-31
Price       196.629
Year           2004
Month             7
Name: 54, dtype: object
55 Date     2004-08-31
Price       193.257
Year           2004
Month             8
Name: 55, dtype: object
56 Date     2004-09-30
Price       214.982
Year           2004
Month             9
Name: 56, dtype: object
57 Date     2004-10-31
Price        235.53
Year           2004
Month            10
Name: 57, dtype: object
58 Date     2004-11-30
Price       265.953
Year           2004
Month            11
Name: 58, dtype: object
59 Date     2004-12-31
Price       264.618
Year           2004
Month            12
Name: 59, dtype: object
60 Date     2005-01-31
Price       263.688
Year           2005
Month             1
Name: 60, dtype: object
61 Date     2005-02-28
Price       282.279
Year           2005
Month             2
Name: 61, dtype: object
62 Date     2005-03-31
Price       276.986
Year           2005
Month             3
Name: 62, dtype: object
63 Date     2005-04-30
Price       239.106
Year           2005
Month             4
Name: 63, dtype: object
64 Date     2005-05-31
Price        284.34
Year           2005
Month             5
Name: 64, dtype: object
65 Date     2005-06-30
Price       290.197
Year           2005
Month             6
Name: 65, dtype: object
66 Date     2005-07-31
Price       285.952
Year           2005
Month             7
Name: 66, dtype: object
67 Date     2005-08-31
Price        305.24
Year           2005
Month             8
Name: 67, dtype: object
68 Date     2005-09-30
Price       315.103
Year           2005
Month             9
Name: 68, dtype: object
69 Date     2005-10-31
Price       323.381
Year           2005
Month            10
Name: 69, dtype: object
70 Date     2005-11-30
Price       334.474
Year           2005
Month            11
Name: 70, dtype: object
71 Date     2005-12-31
Price       379.632
Year           2005
Month            12
Name: 71, dtype: object

In [60]:
data.head()

     Date       Price  Year  Month
0  2000-1  219.942449  2000      1
1  2000-2  275.117647  2000      2
2  2000-3  263.198203  2000      3
3  2000-4  253.428767  2000      4
4  2000-5  215.742602  2000      5

In [61]:
#Delete year and month column as these are not needed anymore
del data['Month']
del data['Year']

In [62]:
data.head()

     Date       Price
0  2000-1  219.942449
1  2000-2  275.117647
2  2000-3  263.198203
3  2000-4  253.428767
4  2000-5  215.742602

In [64]:
data.dtypes

Date      object
Price    float64
dtype: object

All the above operation can be consolidated and performed using single operation.
This is called resampling of data. In pandas we have lot of functions to resample data.

In [80]:
data = pd.read_csv('C:/Users/INTEL/Desktop/Books/Tensorflow/Machine Learning Codes/Exercise Files/data/monthly_price.csv')
data.head()

        Date       Price
0  1/31/2000  219.942449
1  2/29/2000  275.117647
2  3/31/2000  263.198203
3  4/30/2000  253.428767
4  5/31/2000  215.742602

In [81]:
data['Date'] = pd.to_datetime(data['Date'])
data.head()

        Date       Price
0 2000-01-31  219.942449
1 2000-02-29  275.117647
2 2000-03-31  263.198203
3 2000-04-30  253.428767
4 2000-05-31  215.742602

In [82]:
#Converts DatetimeIndex to PeriodIndex based on a certain frequency
data['Date'] = data['Date'].dt.to_period('M')

In [83]:
data.head()

     Date       Price
0 2000-01  219.942449
1 2000-02  275.117647
2 2000-03  263.198203
3 2000-04  253.428767
4 2000-05  215.742602

# Understand Resampling

In [86]:
#below code will generate a dataframe with 20 timestamps starting from 2018 July 1st with an hourly frequency
first_series = pd.DataFrame({'Date' : pd.date_range('06/01/2017', periods = 20, freq = 'H'), 
                                 'Count':list(range(20))},columns=['Date','Count'])

In [87]:
first_series.head()

                 Date  Count
0 2017-06-01 00:00:00      0
1 2017-06-01 01:00:00      1
2 2017-06-01 02:00:00      2
3 2017-06-01 03:00:00      3
4 2017-06-01 04:00:00      4

In [88]:
#set Date column as index
first_series = first_series.set_index('Date')
first_series.head()

                     Count
Date
2017-06-01 00:00:00      0
2017-06-01 01:00:00      1
2017-06-01 02:00:00      2
2017-06-01 03:00:00      3
2017-06-01 04:00:00      4

In [90]:
#create another series with data interval as 40 minutes instead of 1 hour
#ffill ---> forward fill. fills the data points in a forward manner.
#It adds new data rows with immediate information ahead
second_series = first_series.asfreq('40 min',method='ffill')
second_series.head()

                     Count
Date
2017-06-01 00:00:00      0
2017-06-01 00:40:00      0
2017-06-01 01:20:00      1
2017-06-01 02:00:00      2
2017-06-01 02:40:00      2

In [91]:
#bfill--> fill data backwardly
third_series = first_series.asfreq('40 min',method='bfill')
third_series.head()

                     Count
Date
2017-06-01 00:00:00      0
2017-06-01 00:40:00      1
2017-06-01 01:20:00      2
2017-06-01 02:00:00      2
2017-06-01 02:40:00      3

In [92]:
#if we do not want to add any new data in new rows we choose method = None
fourth_series = first_series.asfreq('40 min',method=None)
fourth_series.head()

                     Count
Date
2017-06-01 00:00:00    0.0
2017-06-01 00:40:00    NaN
2017-06-01 01:20:00    NaN
2017-06-01 02:00:00    2.0
2017-06-01 02:40:00    NaN

In [93]:
fourth_series.shape

(29, 1)

# Removing datapoints

In [94]:
fifth_series = first_series.asfreq('5H', method = None)
fifth_series.head()

                     Count
Date
2017-06-01 00:00:00      0
2017-06-01 05:00:00      5
2017-06-01 10:00:00     10
2017-06-01 15:00:00     15

Using above code we are losing the data points. Count represent value at that point. If we are using some other statistics like sum, mean we have to use resample function.

In [95]:
first_series.resample('5H').mean()

                     Count
Date
2017-06-01 00:00:00      2
2017-06-01 05:00:00      7
2017-06-01 10:00:00     12
2017-06-01 15:00:00     17

In [96]:
first_series.resample('5H').sum()

                     Count
Date
2017-06-01 00:00:00     10
2017-06-01 05:00:00     35
2017-06-01 10:00:00     60
2017-06-01 15:00:00     85

In [97]:
first_series.resample('5H').min()

                     Count
Date
2017-06-01 00:00:00      0
2017-06-01 05:00:00      5
2017-06-01 10:00:00     10
2017-06-01 15:00:00     15

In [98]:
first_series.resample('5H').max()

                     Count
Date
2017-06-01 00:00:00      4
2017-06-01 05:00:00      9
2017-06-01 10:00:00     14
2017-06-01 15:00:00     19

Note :-  both backward and forward sampling requires a lot of domain knowledge